Revit 2026 API

# ProjectPositionNorthSouth Property

---

North/South offset

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double NorthSouth { get; set; }
```
```vb
Public Property NorthSouth As Double
	Get
	Set
```
```cpp
public:
property double NorthSouth {
	double get ();
	void set (double value);
}
```
```fsharp
member NorthSouth : float with get, set
```

#### Property Value

Double

The offset of the project location from the site location in the north/south direction. Measured in decimal feet.

#### Reference

ProjectPosition Class

Autodesk.Revit.DB Namespace